/*
 *   ============== 객체 지향 프로그램 ==============
 *    클래스를 만드는 목적
 *    ==============
 *     1. 재사용이 가능(상속, 포함)
 *     2. 클래스가 가지고 있는 데이터를 보호(캡슐화)
 *     3. 변경이 가능, 추가가 가능(다형성)
 *        =======================
 *          유지보수
 *          ===== 신뢰성이 뛰어나야 함
 *   ===========================================
 *    
 *    클래스의 구성요소
 *    ============
 *      변수(page 246)
 *      =======================================================
 *        = 인스턴스 변수: new를 이용할 때마다 메모리가 같이 생성됨
 *        = 공유변수, 클래스변수: static => compile시 자동으로 메모리 생성
 *      ======================================================= 클래스 {블록}안에서 생성
 *        = 지역변수: 메소드 {} 안에서 생성
 *      메소드: 
 *      생성자
 */
public class MainClass4 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
